echo on
READ_VERILOG
hierarchy -check TOP_INSTANCE LIBDIR

# high-level synthesis
setattr -unset always_comb p:*
#proc;
proc_clean
proc_rmdead
proc_init
proc_arst
proc_mux
#proc_dlatch
proc_dff
proc_clean

opt; fsm; opt; memory; opt

techmap; opt

abc
# split larger signals
splitnets -ports; opt
write_json JSON

dfflibmap -liberty STDCELLLIB
abc -constr CONSTRAINTS -liberty STDCELLLIB -D TARGETDELAY

stat -liberty STDCELLLIB TOP_INSTANCE

write_verilog OUT
